==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
GPT2LMHeadModel                          --                        --
├─GPT2Model: 1                           --                        --
│    └─ModuleList: 2-1                   --                        --
├─GPT2Model: 1-1                         [1, 64, 1600]             --
│    └─Embedding: 2-2                    [1, 64, 1600]             80,411,200
│    └─Embedding: 2-3                    [1, 64, 1600]             1,638,400
│    └─ModuleList: 2-1                   --                        --
│    │    └─Block: 3-1                   [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-1          [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-2          [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-1        [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-2        [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-3          [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-4                [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-3        [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-4        [1, 64, 1600]             10,241,600
│    │    └─Block: 3-2                   [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-5          [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-6          [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-5        [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-6        [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-7          [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-8                [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-7        [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-8        [1, 64, 1600]             10,241,600
│    │    └─Block: 3-3                   [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-9          [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-10         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-9        [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-10       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-11         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-12               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-11       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-12       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-4                   [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-13         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-14         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-13       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-14       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-15         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-16               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-15       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-16       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-5                   [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-17         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-18         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-17       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-18       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-19         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-20               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-19       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-20       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-6                   [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-21         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-22         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-21       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-22       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-23         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-24               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-23       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-24       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-7                   [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-25         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-26         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-25       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-26       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-27         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-28               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-27       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-28       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-8                   [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-29         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-30         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-29       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-30       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-31         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-32               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-31       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-32       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-9                   [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-33         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-34         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-33       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-34       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-35         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-36               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-35       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-36       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-10                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-37         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-38         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-37       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-38       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-39         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-40               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-39       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-40       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-11                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-41         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-42         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-41       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-42       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-43         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-44               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-43       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-44       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-12                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-45         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-46         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-45       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-46       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-47         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-48               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-47       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-48       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-13                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-49         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-50         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-49       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-50       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-51         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-52               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-51       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-52       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-14                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-53         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-54         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-53       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-54       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-55         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-56               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-55       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-56       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-15                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-57         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-58         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-57       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-58       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-59         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-60               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-59       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-60       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-16                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-61         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-62         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-61       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-62       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-63         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-64               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-63       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-64       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-17                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-65         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-66         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-65       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-66       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-67         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-68               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-67       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-68       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-18                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-69         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-70         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-69       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-70       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-71         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-72               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-71       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-72       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-19                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-73         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-74         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-73       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-74       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-75         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-76               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-75       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-76       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-20                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-77         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-78         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-77       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-78       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-79         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-80               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-79       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-80       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-21                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-81         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-82         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-81       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-82       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-83         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-84               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-83       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-84       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-22                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-85         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-86         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-85       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-86       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-87         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-88               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-87       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-88       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-23                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-89         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-90         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-89       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-90       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-91         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-92               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-91       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-92       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-24                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-93         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-94         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-93       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-94       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-95         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-96               [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-95       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-96       [1, 64, 1600]             10,241,600
│    │    └─Block: 3-25                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-97         [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-98         [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-97       [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-98       [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-99         [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-100              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-99       [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-100      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-26                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-101        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-102        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-101      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-102      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-103        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-104              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-103      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-104      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-27                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-105        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-106        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-105      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-106      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-107        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-108              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-107      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-108      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-28                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-109        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-110        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-109      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-110      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-111        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-112              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-111      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-112      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-29                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-113        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-114        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-113      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-114      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-115        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-116              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-115      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-116      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-30                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-117        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-118        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-117      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-118      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-119        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-120              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-119      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-120      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-31                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-121        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-122        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-121      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-122      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-123        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-124              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-123      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-124      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-32                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-125        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-126        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-125      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-126      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-127        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-128              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-127      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-128      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-33                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-129        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-130        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-129      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-130      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-131        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-132              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-131      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-132      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-34                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-133        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-134        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-133      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-134      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-135        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-136              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-135      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-136      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-35                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-137        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-138        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-137      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-138      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-139        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-140              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-139      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-140      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-36                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-141        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-142        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-141      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-142      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-143        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-144              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-143      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-144      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-37                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-145        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-146        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-145      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-146      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-147        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-148              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-147      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-148      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-38                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-149        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-150        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-149      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-150      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-151        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-152              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-151      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-152      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-39                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-153        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-154        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-153      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-154      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-155        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-156              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-155      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-156      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-40                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-157        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-158        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-157      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-158      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-159        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-160              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-159      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-160      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-41                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-161        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-162        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-161      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-162      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-163        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-164              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-163      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-164      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-42                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-165        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-166        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-165      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-166      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-167        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-168              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-167      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-168      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-43                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-169        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-170        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-169      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-170      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-171        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-172              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-171      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-172      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-44                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-173        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-174        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-173      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-174      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-175        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-176              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-175      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-176      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-45                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-177        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-178        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-177      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-178      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-179        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-180              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-179      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-180      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-46                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-181        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-182        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-181      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-182      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-183        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-184              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-183      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-184      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-47                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-185        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-186        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-185      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-186      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-187        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-188              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-187      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-188      [1, 64, 1600]             10,241,600
│    │    └─Block: 3-48                  [1, 64, 1600]             --
│    │    │    └─LayerNorm: 4-189        [1, 64, 1600]             3,200
│    │    │    └─Attention: 4-190        [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-189      [1, 64, 4800]             7,684,800
│    │    │    │    └─Conv1D: 5-190      [1, 64, 1600]             2,561,600
│    │    │    └─LayerNorm: 4-191        [1, 64, 1600]             3,200
│    │    │    └─MLP: 4-192              [1, 64, 1600]             --
│    │    │    │    └─Conv1D: 5-191      [1, 64, 6400]             10,246,400
│    │    │    │    └─Conv1D: 5-192      [1, 64, 1600]             10,241,600
│    └─LayerNorm: 2-4                    [1, 64, 1600]             3,200
├─GPT2LMHead: 1-2                        [1, 64, 50257]            --
│    └─Linear: 2-5                       [1, 64, 50257]            80,411,200
==========================================================================================
Total params: 1,638,022,400
Trainable params: 1,638,022,400
Non-trainable params: 0
Total mult-adds (T): 5.90
==========================================================================================
Input size (MB): 0.00
Forward/backward pass size (MB): 460.73
Params size (MB): 6552.09
Estimated Total Size (MB): 7012.82
==========================================================================================