==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
GPT2LMHeadModel                          --                        --
├─GPT2Model: 1                           --                        --
│    └─ModuleList: 2-1                   --                        --
├─GPT2Model: 1-1                         [1, 64, 768]              --
│    └─Embedding: 2-2                    [1, 64, 768]              38,597,376
│    └─Embedding: 2-3                    [1, 64, 768]              786,432
│    └─ModuleList: 2-1                   --                        --
│    │    └─Block: 3-1                   [1, 64, 768]              --
│    │    │    └─LayerNorm: 4-1          [1, 64, 768]              1,536
│    │    │    └─Attention: 4-2          [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-1        [1, 64, 2304]             1,771,776
│    │    │    │    └─Conv1D: 5-2        [1, 64, 768]              590,592
│    │    │    └─LayerNorm: 4-3          [1, 64, 768]              1,536
│    │    │    └─MLP: 4-4                [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-3        [1, 64, 3072]             2,362,368
│    │    │    │    └─Conv1D: 5-4        [1, 64, 768]              2,360,064
│    │    └─Block: 3-2                   [1, 64, 768]              --
│    │    │    └─LayerNorm: 4-5          [1, 64, 768]              1,536
│    │    │    └─Attention: 4-6          [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-5        [1, 64, 2304]             1,771,776
│    │    │    │    └─Conv1D: 5-6        [1, 64, 768]              590,592
│    │    │    └─LayerNorm: 4-7          [1, 64, 768]              1,536
│    │    │    └─MLP: 4-8                [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-7        [1, 64, 3072]             2,362,368
│    │    │    │    └─Conv1D: 5-8        [1, 64, 768]              2,360,064
│    │    └─Block: 3-3                   [1, 64, 768]              --
│    │    │    └─LayerNorm: 4-9          [1, 64, 768]              1,536
│    │    │    └─Attention: 4-10         [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-9        [1, 64, 2304]             1,771,776
│    │    │    │    └─Conv1D: 5-10       [1, 64, 768]              590,592
│    │    │    └─LayerNorm: 4-11         [1, 64, 768]              1,536
│    │    │    └─MLP: 4-12               [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-11       [1, 64, 3072]             2,362,368
│    │    │    │    └─Conv1D: 5-12       [1, 64, 768]              2,360,064
│    │    └─Block: 3-4                   [1, 64, 768]              --
│    │    │    └─LayerNorm: 4-13         [1, 64, 768]              1,536
│    │    │    └─Attention: 4-14         [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-13       [1, 64, 2304]             1,771,776
│    │    │    │    └─Conv1D: 5-14       [1, 64, 768]              590,592
│    │    │    └─LayerNorm: 4-15         [1, 64, 768]              1,536
│    │    │    └─MLP: 4-16               [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-15       [1, 64, 3072]             2,362,368
│    │    │    │    └─Conv1D: 5-16       [1, 64, 768]              2,360,064
│    │    └─Block: 3-5                   [1, 64, 768]              --
│    │    │    └─LayerNorm: 4-17         [1, 64, 768]              1,536
│    │    │    └─Attention: 4-18         [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-17       [1, 64, 2304]             1,771,776
│    │    │    │    └─Conv1D: 5-18       [1, 64, 768]              590,592
│    │    │    └─LayerNorm: 4-19         [1, 64, 768]              1,536
│    │    │    └─MLP: 4-20               [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-19       [1, 64, 3072]             2,362,368
│    │    │    │    └─Conv1D: 5-20       [1, 64, 768]              2,360,064
│    │    └─Block: 3-6                   [1, 64, 768]              --
│    │    │    └─LayerNorm: 4-21         [1, 64, 768]              1,536
│    │    │    └─Attention: 4-22         [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-21       [1, 64, 2304]             1,771,776
│    │    │    │    └─Conv1D: 5-22       [1, 64, 768]              590,592
│    │    │    └─LayerNorm: 4-23         [1, 64, 768]              1,536
│    │    │    └─MLP: 4-24               [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-23       [1, 64, 3072]             2,362,368
│    │    │    │    └─Conv1D: 5-24       [1, 64, 768]              2,360,064
│    │    └─Block: 3-7                   [1, 64, 768]              --
│    │    │    └─LayerNorm: 4-25         [1, 64, 768]              1,536
│    │    │    └─Attention: 4-26         [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-25       [1, 64, 2304]             1,771,776
│    │    │    │    └─Conv1D: 5-26       [1, 64, 768]              590,592
│    │    │    └─LayerNorm: 4-27         [1, 64, 768]              1,536
│    │    │    └─MLP: 4-28               [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-27       [1, 64, 3072]             2,362,368
│    │    │    │    └─Conv1D: 5-28       [1, 64, 768]              2,360,064
│    │    └─Block: 3-8                   [1, 64, 768]              --
│    │    │    └─LayerNorm: 4-29         [1, 64, 768]              1,536
│    │    │    └─Attention: 4-30         [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-29       [1, 64, 2304]             1,771,776
│    │    │    │    └─Conv1D: 5-30       [1, 64, 768]              590,592
│    │    │    └─LayerNorm: 4-31         [1, 64, 768]              1,536
│    │    │    └─MLP: 4-32               [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-31       [1, 64, 3072]             2,362,368
│    │    │    │    └─Conv1D: 5-32       [1, 64, 768]              2,360,064
│    │    └─Block: 3-9                   [1, 64, 768]              --
│    │    │    └─LayerNorm: 4-33         [1, 64, 768]              1,536
│    │    │    └─Attention: 4-34         [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-33       [1, 64, 2304]             1,771,776
│    │    │    │    └─Conv1D: 5-34       [1, 64, 768]              590,592
│    │    │    └─LayerNorm: 4-35         [1, 64, 768]              1,536
│    │    │    └─MLP: 4-36               [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-35       [1, 64, 3072]             2,362,368
│    │    │    │    └─Conv1D: 5-36       [1, 64, 768]              2,360,064
│    │    └─Block: 3-10                  [1, 64, 768]              --
│    │    │    └─LayerNorm: 4-37         [1, 64, 768]              1,536
│    │    │    └─Attention: 4-38         [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-37       [1, 64, 2304]             1,771,776
│    │    │    │    └─Conv1D: 5-38       [1, 64, 768]              590,592
│    │    │    └─LayerNorm: 4-39         [1, 64, 768]              1,536
│    │    │    └─MLP: 4-40               [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-39       [1, 64, 3072]             2,362,368
│    │    │    │    └─Conv1D: 5-40       [1, 64, 768]              2,360,064
│    │    └─Block: 3-11                  [1, 64, 768]              --
│    │    │    └─LayerNorm: 4-41         [1, 64, 768]              1,536
│    │    │    └─Attention: 4-42         [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-41       [1, 64, 2304]             1,771,776
│    │    │    │    └─Conv1D: 5-42       [1, 64, 768]              590,592
│    │    │    └─LayerNorm: 4-43         [1, 64, 768]              1,536
│    │    │    └─MLP: 4-44               [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-43       [1, 64, 3072]             2,362,368
│    │    │    │    └─Conv1D: 5-44       [1, 64, 768]              2,360,064
│    │    └─Block: 3-12                  [1, 64, 768]              --
│    │    │    └─LayerNorm: 4-45         [1, 64, 768]              1,536
│    │    │    └─Attention: 4-46         [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-45       [1, 64, 2304]             1,771,776
│    │    │    │    └─Conv1D: 5-46       [1, 64, 768]              590,592
│    │    │    └─LayerNorm: 4-47         [1, 64, 768]              1,536
│    │    │    └─MLP: 4-48               [1, 64, 768]              --
│    │    │    │    └─Conv1D: 5-47       [1, 64, 3072]             2,362,368
│    │    │    │    └─Conv1D: 5-48       [1, 64, 768]              2,360,064
│    └─LayerNorm: 2-4                    [1, 64, 768]              1,536
├─GPT2LMHead: 1-2                        [1, 64, 50257]            --
│    └─Linear: 2-5                       [1, 64, 50257]            38,597,376
==========================================================================================
Total params: 163,037,184
Trainable params: 163,037,184
Non-trainable params: 0
Total mult-adds (G): 163.34
==========================================================================================
Input size (MB): 0.00
Forward/backward pass size (MB): 78.82
Params size (MB): 652.15
Estimated Total Size (MB): 730.97
==========================================================================================